<?php

use yii\db\Migration;

/**
 * Class m190226_054643_insert_data_to_metro_table
 */
class m190226_054643_insert_data_to_metro_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%metro}}', [
            'name', 'line'
        ], [
            ['Автово', 1],
            ['Адмиралтейская', 5],
            ['Академическая', 1],
            ['Балтийская', 1],
            ['Беговая', 3],
            ['Бухарестская', 5],
            ['Василеостровкая', 3],
            ['Владимирская', 1],
            ['Волковская', 5],
            ['Выборгская', 1],
            ['Горьковская', 2],
            ['Гражданский проспект', 1],
            ['Девяткино', 1],
            ['Достоевская', 4],
            ['Елизаровская', 3],
            ['Звездная', 2],
            ['Звенигородская - Пушкинская', 5],
            ['Кировский завод', 1],
            ['Комендантский проспект', 5],
            ['Крестовкий остров', 5],
            ['Купчино', 2],
            ['Ладожская', 4],
            ['Ленинский проспект', 1],
            ['Лесная', 1],
            ['Лиговский проспект', 4],
            ['Ломоносовская', 3],
            ['Маяковская - Площадь Восстания', 3],
            ['Международная', 5],
            ['Московская', 2],
            ['Московские ворота', 2],
            ['Нарвская', 1],
            ['Невский проспект - Гостиный двор', 3],
            ['Новокрестовская', 3],
            ['Новочеркасская', 4],
            ['Обводный канал 1', 5],
            ['Обухово', 3],
            ['Озерки', 2],
            ['Парк Победы', 2],
            ['Парнас', 2],
            ['Петроградская', 2],
            ['Пионерская', 2],
            ['Площадь Александра Невского', 3],
            ['Площадь Ленина', 1],
            ['Площадь Мужества', 1],
            ['Политехническая', 1],
            ['Приморская', 3],
            ['Пролетарская', 3],
            ['Проспект Большевиков', 4],
            ['Проспект Ветеранов', 1],
            ['Проспект Просвещения', 2],
            ['Рыбацкое', 3],
            ['Садовая - Сенная площадь - Спасская', 5],
            ['Спортивная', 5],
            ['Старая деревня', 5],
            ['Технологический институт', 2],
            ['Удельная', 2],
            ['Улица Дыбенко', 4],
            ['Фрунзенская', 2],
            ['Черная речка', 2],
            ['Чернышевская', 1],
            ['Чкаловская', 5],
            ['Электросила', 2],
            ['Лен. область', 6],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        return true;
    }
}
