<?php

use yii\db\Migration;

/**
 * Class m190224_081544_insert_data_to_category_table
 */
class m190224_081544_insert_data_to_category_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%category}}', [
            'name', 'category_type_id'
        ], [
            ['Заведущий производством', 1],
            ['Су-шеф', 1],
            ['Шеф-кондитер', 1],
            ['Су-шеф холодного цеха', 1],
            ['Су-шеф горячего цеха', 1],
            ['Су-шеф фритюрного цеха', 1],
            ['Су-шеф мангал', 1],
            ['Су-шеф колбасного цеха', 1],
            ['Старший повар мясного цеха', 1],
            ['Старший повар овощного цеха', 1],
            ['Старший повар служебного питания', 1],
            ['Повар холодного цеха', 1],
            ['Повар горячего цеха', 1],
            ['Повар мясного цеха', 1],
            ['Повар-кондитер', 1],
            ['Повар-пекарь', 1],
            ['Повар-фритюрщик', 1],
            ['Повар-овощник', 1],
            ['Повар-заготовщик', 1],
            ['Повар служебного питания', 1],
            ['Повар-мангальщик', 1],
            ['Повар колбасного цеха', 1],
            ['Повар-коптильщик', 2],
            ['Кузьмич', 2],
            ['Менеджер ресторана', 3],
            ['Банкетный менеджер', 3],
            ['Грант-официант', 3],
            ['Официант', 3],
            ['Старший помощник официанта', 3],
            ['Помощник официанта', 3],
            ['Бар-менеджер', 3],
            ['Старший бармен', 3],
            ['Бармен', 3],
            ['Старшая хостес', 3],
            ['Хостес', 3],
            ['Няня', 3],
            ['Гардеробщик', 3],
            ['Личный помощник руководителя ', 4],
            ['Ведущий менеджер по персоналу', 4],
            ['Специалист по кадровому делопроизводству', 4],
            ['Менеджер по персоналу ', 4],
            ['Ассистент менеджера по персоналу', 4],
            ['Заместитель главного бухгалтер ', 4],
            ['Бухгалтер (банк-клиент)', 4],
            ['Старший аудитор', 4],
            ['Старший экономист', 4],
            ['Бухгалтер-калькулятор', 4],
            ['Экономист', 4],
            ['Аудитор', 4],
            ['Юрист', 4],
            ['Pr-менеджер', 4],
            ['Маркетолог', 4],
            ['Web-дизайнер', 4],
            ['Специалист по безопасности', 4],
            ['Водитель', 4],
            ['Менеджер по закупкам', 5],
            ['Товаровед', 5],
            ['Грузчик', 5],
            ['Мойщица посуды', 6],
            ['Мойщица посуды на белой мойке', 6],
            ['Мойщица посуды на черновой мойке', 6],
            ['Уборщица в день', 6],
            ['Уборщица в ночь', 6],
            ['Прачка', 6],
            ['Садовник', 6],
            ['Техник', 7],
            ['Декоратор', 7],
            ['Разнорабочий', 7],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        return true;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m190224_081544_insert_data_to_category_table cannot be reverted.\n";

        return false;
    }
    */
}
